# Titanic dataset -- build samples for pygame

April 20, 2021

- I want a very very basic one for building the program, plus a few options for number of samples

In [49]:
import numpy as np
import pandas as pd

#### Get column names

In [50]:
cols = pd.read_csv('data/titanic.csv')
new_cols = [cols.columns[6], cols.columns[3], cols.columns[0]]
new_cols

['fare', 'age', 'survived']

#### Apply column names

In [51]:
arr = np.load('data/titanic.npy')

In [52]:
df = pd.DataFrame(arr, columns = new_cols)
df.head()

      fare   age  survived
0   7.2500  22.0       0.0
1  71.2833  38.0       1.0
2   7.9250  26.0       1.0
3  53.1000  35.0       1.0
4   8.0500  35.0       0.0

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   fare      714 non-null    float64
 1   age       714 non-null    float64
 2   survived  714 non-null    float64
dtypes: float64(3)
memory usage: 16.9 KB

## 1. Build samples

In [54]:
df30 = df.sample(30)

df100 = df.sample(100)

df250 = df.sample(250)

## 2. Convert to numpy

In [55]:
arr30 = df30.to_numpy()

arr100 = df100.to_numpy()

arr250 = df250.to_numpy()

arr = df.to_numpy()

## 3. Save

In [56]:
np.save('../data/arr30', arr30)

In [57]:
np.save('../data/arr100', arr100)

In [58]:
np.save('../data/arr250', arr250)

In [59]:
np.save('../data/arr', arr)

## 4. Get some details about arr30 -- so I know how to use it in pygame

In [60]:
df15 = pd.DataFrame(arr15, columns = new_cols)

df15.head(3)

      fare   age  survived
0  66.6000  22.0       1.0
1  46.9000   9.0       0.0
2  76.7292  48.0       1.0

In [61]:
df15.describe().loc[['min', 'max']]

        fare   age  survived
min   7.1250   9.0       0.0
max  76.7292  71.0       1.0

#### X axis will be fare, Y axis will be age

#### Get some details about the others

In [62]:
df30.iloc[:,:2].describe().loc[['min', 'max']]

         fare   age
min    7.2292   1.0
max  512.3292  74.0

In [63]:
df100.iloc[:,:2].describe().loc[['min', 'max']]

         fare    age
min    0.0000   0.67
max  512.3292  80.00

In [64]:
df250.iloc[:,:2].describe().loc[['min', 'max']]

        fare    age
min    0.000   0.42
max  227.525  70.50

In [65]:
df.iloc[:,:2].describe().loc[['min', 'max']]

         fare    age
min    0.0000   0.42
max  512.3292  80.00